app/controllers/songs_controller.rb

  def index
    @artist = Artist.find_by_id(params[:artist_id]) if params[:artist_id]
    @songs = @artist.songs if @artist
    @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    @song = Song.find_by_id(params[:id])
    @artist = Artist.find_by_id(params[:artist_id]) if params[:artist_id]
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]